import React, {Component} from 'react';
import {StyleSheet, View, Text, ScrollView} from 'react-native';

export default class PrivacyPolicy extends Component {
	render() {
		return(
			<View>
				<Text style={styles.title}>개인정보수집 및 이용동의</Text>
				<ScrollView style={styles.contents}>
					<Text style={styles.subTitle}>제 1항</Text>
					<Text>이네들은 까닭이요, 다하지 피어나듯이 쉬이 이런 거외다. 이름과 된 어머니 까닭이요, 위에 패, 이제 언덕 슬퍼하는 거외다. 불러 가을 책상을 이런 토끼, 거외다. 무성할 아름다운 이웃 까닭이요, 무덤 있습니다. 하나에 차 나의 새겨지는 어머니, 이름을 쉬이 하늘에는 그리고 까닭입니다. 하나 지나가는 잔디가 어머님, 있습니다. 추억과 한 이웃 이름과 별 비둘기, 그리워 옥 거외다. 불러 경, 당신은 있습니다. 별 멀리 묻힌 내일 까닭입니다. 하늘에는 별이 언덕 된 쉬이 라이너 시인의 내일 이제 봅니다. 멀듯이, 이런 다 많은 까닭입니다.
					한 슬퍼하는 라이너 무성할 이런 봅니다. 파란 없이 애기 하나에 별 나의 내일 프랑시스 아스라히 까닭입니다. 언덕 봄이 오면 이 어머니, 경, 멀리 소녀들의 있습니다. 패, 하나에 이름자 많은 거외다. 이런 계절이 이름과, 사랑과 있습니다. 멀듯이, 이웃 별 하나에 나는 어머님, 듯합니다. 그러나 이런 아름다운 별에도 하나에 듯합니다. 그리워 봄이 내 위에 딴은 내 강아지, 많은 가을로 있습니다. 많은 보고, 위에 내 지나가는 그러나 버리었습니다. 된 어머니, 흙으로 지나고 별 없이 이름과, 오면 어머님, 버리었습니다. 이름과, 위에도 릴케 이름을 노새, 이웃 하나에 아무 계십니다.</Text>
					<Text>이네들은 까닭이요, 다하지 피어나듯이 쉬이 이런 거외다. 이름과 된 어머니 까닭이요, 위에 패, 이제 언덕 슬퍼하는 거외다. 불러 가을 책상을 이런 토끼, 거외다. 무성할 아름다운 이웃 까닭이요, 무덤 있습니다. 하나에 차 나의 새겨지는 어머니, 이름을 쉬이 하늘에는 그리고 까닭입니다. 하나 지나가는 잔디가 어머님, 있습니다. 추억과 한 이웃 이름과 별 비둘기, 그리워 옥 거외다. 불러 경, 당신은 있습니다. 별 멀리 묻힌 내일 까닭입니다. 하늘에는 별이 언덕 된 쉬이 라이너 시인의 내일 이제 봅니다. 멀듯이, 이런 다 많은 까닭입니다.
					한 슬퍼하는 라이너 무성할 이런 봅니다. 파란 없이 애기 하나에 별 나의 내일 프랑시스 아스라히 까닭입니다. 언덕 봄이 오면 이 어머니, 경, 멀리 소녀들의 있습니다. 패, 하나에 이름자 많은 거외다. 이런 계절이 이름과, 사랑과 있습니다. 멀듯이, 이웃 별 하나에 나는 어머님, 듯합니다. 그러나 이런 아름다운 별에도 하나에 듯합니다. 그리워 봄이 내 위에 딴은 내 강아지, 많은 가을로 있습니다. 많은 보고, 위에 내 지나가는 그러나 버리었습니다. 된 어머니, 흙으로 지나고 별 없이 이름과, 오면 어머님, 버리었습니다. 이름과, 위에도 릴케 이름을 노새, 이웃 하나에 아무 계십니다.</Text>
					<Text style={styles.subTitle}>제 1항</Text>
					<Text>이네들은 까닭이요, 다하지 피어나듯이 쉬이 이런 거외다. 이름과 된 어머니 까닭이요, 위에 패, 이제 언덕 슬퍼하는 거외다. 불러 가을 책상을 이런 토끼, 거외다. 무성할 아름다운 이웃 까닭이요, 무덤 있습니다. 하나에 차 나의 새겨지는 어머니, 이름을 쉬이 하늘에는 그리고 까닭입니다. 하나 지나가는 잔디가 어머님, 있습니다. 추억과 한 이웃 이름과 별 비둘기, 그리워 옥 거외다. 불러 경, 당신은 있습니다. 별 멀리 묻힌 내일 까닭입니다. 하늘에는 별이 언덕 된 쉬이 라이너 시인의 내일 이제 봅니다. 멀듯이, 이런 다 많은 까닭입니다.
					한 슬퍼하는 라이너 무성할 이런 봅니다. 파란 없이 애기 하나에 별 나의 내일 프랑시스 아스라히 까닭입니다. 언덕 봄이 오면 이 어머니, 경, 멀리 소녀들의 있습니다. 패, 하나에 이름자 많은 거외다. 이런 계절이 이름과, 사랑과 있습니다. 멀듯이, 이웃 별 하나에 나는 어머님, 듯합니다. 그러나 이런 아름다운 별에도 하나에 듯합니다. 그리워 봄이 내 위에 딴은 내 강아지, 많은 가을로 있습니다. 많은 보고, 위에 내 지나가는 그러나 버리었습니다. 된 어머니, 흙으로 지나고 별 없이 이름과, 오면 어머님, 버리었습니다. 이름과, 위에도 릴케 이름을 노새, 이웃 하나에 아무 계십니다.</Text>
				</ScrollView>
			</View>
		)
	}
}

const styles = StyleSheet.create({
	title: {
		fontSize: 20,
		fontWeight: '700'
	},
	contents: {
		marginTop: 20,
		marginBottom: 30,
	},
	subTitle: {
		fontSize: 17,
	}
});